backend/app/controllers/api/v1/jokes_controller.rb

SELECT "jokes".* FROM "jokes"  ORDER BY "jokes"."id" ASC
---
  def index
    @jokes = Joke.all

SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1  ORDER BY "jokes"."id" ASC LIMIT 1  [["id", 4]]
---
  def show
    @joke = Joke.find(params[:id])

INSERT INTO "jokes" ("setup", "punchline", "rating") VALUES ($1, $2, $3) RETURNING "id"  [["setup", "etbrsynw"], ["punchline", "tybwruneutje"], ["rating", 5]]
---
  def create
    binding.pry
    joke = Joke.new(create_joke_params)

    if joke.save